scripts/loadtest/artillery.yml
config:
  target: "https://iryeokfit.com"
  timeout: 35 # wait-complete api 최대 폴링 시간(30초) 기준.
  defaults:
    headers:
      Accept-Encoding: "gzip" # artillery 클라이언트가 zstd 응답을 디코딩 못해서 회피
  plugins:
    metrics-by-endpoint:
      suppressOutput: false #  요청별 p95/p99를 콘솔에 따로 출력
  phases:
    - name: "5 VUs"
      duration: 1
      arrivalCount: 5

scenarios:
  - name: "signup -> login -> upload resume -> create report -> wait complete"
    flow:
      - post:
          url: "/users"
          name: "signup"
          json:
            name: "부하테스트"
            email: "loadtest-{{ $uuid }}@test.com"
            password: "qngkdmlqkseoakfdmstkdtkRjfRJf"
            phoneNumber: "010{{ $randomNumber(10000000, 99999999) }}"
          capture:
            - json: "$.email"
              as: "email"

      - post:
          url: "/auth/login"
          name: "login"
          json:
            email: "{{ email }}"
            password: "qngkdmlqkseoakfdmstkdtkRjfRJf"
          capture:
            - json: "$.token"
              as: "token"
            - json: "$.userId"
              as: "userId"

      - post:
          url: "/resumes/upload"
          name: "upload resume"
          headers:
            Authorization: "Bearer {{ token }}"
          formData:
            userId: "{{ userId }}"
            file:
              fromFile: "./resources/sample-resume.pdf"
          capture:
            - json: "$.id"
              as: "resumeId"

      - post:
          url: "/reports"
          name: "create report"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            resumeId: "{{ resumeId }}"
            userId: "{{ userId }}"
            title: "부하테스트 리포트"
          capture:
            - json: "$.id"
              as: "reportId"

      - post:
          url: "/feedbacks/generate/{{ reportId }}"
          name: "generate feedback (5-7.5s)"
          headers:
            Authorization: "Bearer {{ token }}"

      - get:
          url: "/reports/{{ reportId }}/wait-complete"
          name: "wait complete"
          headers:
            Authorization: "Bearer {{ token }}"